#+TITLE: Emacs Configuration
#+AUTHOR: Erik Kessler

#+PROPERTY: header-args :results none

** Projectile
#+BEGIN_SRC emacs-lisp
  (use-package ag :ensure t)
  (use-package projectile
    :ensure projectile
    :config 
    (projectile-global-mode t)
    (setq projectile-enable-caching t)
    :diminish projectile-mode)
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (defun projectile-use-magit-if-possible ()
    "If the project being switched to is a git repository, invoke
  magit-status on the project root directory. Use dired otherwise."
    (interactive)
    (if (and (executable-find "git")
             (eq (projectile-project-vcs) 'git))
        (magit-status (projectile-project-root))
      (dired (projectile-project-root))))

  (setq projectile-switch-project-action 'projectile-use-magit-if-possible)
#+END_SRC

#+RESULTS:
=projectile-use-magit-if-possible
=   
